samples/business-process-samples/product/src/main/resources/bpel/2.0/PickOneWay/pickSpade.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:pic="http://www.stark.com/PickService">
   <soapenv:Header/>
   <soapenv:Body>
      <pic:pickSpade>
         <pic:Deck>One</pic:Deck>
      </pic:pickSpade>
   </soapenv:Body>
</soapenv:Envelope>

